OpenFOAM/cylinder2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       17775;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       17835;
    }
    topAndBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          210;
        startFace       17895;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       18105;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18000;
        startFace       18225;
    }
)

// ************************************************************************* //
